In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Class\Term V\Python (Data_Analytics)\Case 2\Train.csv")

In [3]:
df.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,NaN,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,NaN,High,6.0,Cat_6,A

#Data-Preprocessing

In [6]:
df.isna().sum()

ID                   0
Gender               0
Ever_Married       140
Age                  0
Graduated           78
Profession         124
Work_Experience    829
Spending_Score       0
Family_Size        335
Var_1               76
Segmentation         0
dtype: int64

In [11]:
df.dtypes

ID                   int64
Gender              object
Ever_Married        object
Age                  int64
Graduated           object
Profession          object
Work_Experience    float64
Spending_Score      object
Family_Size        float64
Var_1               object
Segmentation        object
dtype: object

In [12]:
int(round(df['Work_Experience'].mean(),0))

3

In [13]:
df['Work_Experience'].fillna(3,inplace=True)

In [14]:
df['Ever_Married'].mode()

0    Yes
Name: Ever_Married, dtype: object

In [15]:
df['Ever_Married'].fillna('Yes',inplace=True)

In [16]:
int(round(df['Family_Size'].mean(),0))

3

In [17]:
df['Family_Size'].fillna(3,inplace=True)

In [18]:
df['Graduated'].mode()

0    Yes
Name: Graduated, dtype: object

In [19]:
df['Graduated'].fillna('Yes',inplace=True)

In [20]:
df['Profession'].mode()

0    Artist
Name: Profession, dtype: object

In [21]:
df['Profession'].fillna('Artist',inplace=True)

In [23]:
df.isna().sum()

ID                  0
Gender              0
Ever_Married        0
Age                 0
Graduated           0
Profession          0
Work_Experience     0
Spending_Score      0
Family_Size         0
Var_1              76
Segmentation        0
dtype: int64

In [24]:
df['Var_1'].mode()

0    Cat_6
Name: Var_1, dtype: object

In [25]:
df['Var_1'].fillna('Cat_6',inplace=True)

In [26]:
df.isna().sum()

ID                 0
Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
Segmentation       0
dtype: int64

In [27]:
df=df.drop(['ID'],axis=1)

In [28]:
df.head()

,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,Female,Yes,38,Yes,Engineer,3.0,Average,3.0,Cat_4,A
2,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,Female,Yes,40,Yes,Entertainment,3.0,High,6.0,Cat_6,A

In [30]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [31]:
df['Gender_Enc']=le.fit_transform(df['Gender'])

In [32]:
df['Ever_Married_Enc']=le.fit_transform(df['Ever_Married'])

In [33]:
df['Graduated_Enc']=le.fit_transform(df['Graduated'])

In [34]:
df['Profession'].value_counts()

Profession
Artist           2640
Healthcare       1332
Entertainment     949
Engineer          699
Doctor            688
Lawyer            623
Executive         599
Marketing         292
Homemaker         246
Name: count, dtype: int64

In [35]:
df['Profession_Enc'] = df['Profession'].map({'Artist':0, 'Healthcare':1,'Entertainment':2, 'Engineer':3, 'Doctor':4, 'Lawyer':5, 'Executive':6, 'Marketing':7, 'Homemaker':8}).astype(int)

In [36]:
df['Spending_Score'].value_counts()

Spending_Score
Low        4878
Average    1974
High       1216
Name: count, dtype: int64

In [38]:
df['Spending_Score_Enc'] = df['Spending_Score'].map({'Low':0, 'Average':1,'High':2}).astype(int)

In [39]:
df['Var_1'].value_counts()

Var_1
Cat_6    5314
Cat_4    1089
Cat_3     822
Cat_2     422
Cat_7     203
Cat_1     133
Cat_5      85
Name: count, dtype: int64

In [40]:
df['Var_1_Enc'] = df['Var_1'].map({'Cat_6':0, 'Cat_4':1,'Cat_3':2, 'Cat_2':3, 'Cat_7':4, 'Cat_1':5, 'Cat_5':6}).astype(int)

In [41]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()

selected_columns = ['Age', 'Work_Experience', 'Family_Size']
x=df[selected_columns]
scaler.fit(x)

scaled_data = scaler.transform(x)

print(scaled_data)

[[-1.28462344 -0.51987856  0.76269849]
 [-0.32715082  0.09958389  0.09580227]
 [ 1.40826831 -0.51987856 -1.23799017]
 ...
 [-0.62636101 -0.51987856 -1.23799017]
 [-0.98541324 -0.51987856  0.76269849]
 [-0.38699286 -0.82960978  0.09580227]]

In [42]:
y=pd.DataFrame(scaled_data,columns=['Age_sc', 'Work_Experience_sc', 'Family_Size_sc'])
y.head()

     Age_sc  Work_Experience_sc  Family_Size_sc
0 -1.284623           -0.519879        0.762698
1 -0.327151            0.099584        0.095802
2  1.408268           -0.519879       -1.237990
3  1.408268           -0.829610       -0.571094
4 -0.207467            0.099584        2.096491

In [43]:
df=df.join(y)
df.head()

,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation,Gender_Enc,Ever_Married_Enc,Graduated_Enc,Profession_Enc,Spending_Score_Enc,Var_1_Enc,Age_sc,Work_Experience_sc,Family_Size_sc
0,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D,1,0,0,1,0,1,-1.284623,-0.519879,0.762698
1,Female,Yes,38,Yes,Engineer,3.0,Average,3.0,Cat_4,A,0,1,1,3,1,1,-0.327151,0.099584,0.095802
2,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B,0,1,1,3,0,0,1.408268,-0.519879,-1.237990
3,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B,1,1,1,5,2,0,1.408268,-0.829610,-0.571094
4,Female,Yes,40,Yes,Entertainment,3.0,High,6.0,Cat_6,A,0,1,1,2,2,0,-0.207467,0.099584,2.096491

In [44]:
df1=df

In [45]:
df=df.drop(['Gender', 'Ever_Married', 'Age', 'Graduated', 'Profession', 'Work_Experience', 'Spending_Score', 'Family_Size', 'Var_1'],axis=1)

In [46]:
df.head()

,Segmentation,Gender_Enc,Ever_Married_Enc,Graduated_Enc,Profession_Enc,Spending_Score_Enc,Var_1_Enc,Age_sc,Work_Experience_sc,Family_Size_sc
0,D,1,0,0,1,0,1,-1.284623,-0.519879,0.762698
1,A,0,1,1,3,1,1,-0.327151,0.099584,0.095802
2,B,0,1,1,3,0,0,1.408268,-0.519879,-1.237990
3,B,1,1,1,5,2,0,1.408268,-0.829610,-0.571094
4,A,0,1,1,2,2,0,-0.207467,0.099584,2.096491